tests/taurus/isochrones/gateway.yml
---
execution:
- concurrency: 10 
  ramp-up: 1m
  hold-for: 5m
  scenario: isochrones

scenarios:
  isochrones:
    requests:
        - url: https://api.openrouteservice.org/isochrones?api_key=58d904a497c67e00015b45fc7e9cb57ec548435a7641bdf6dc3f4cbe&attributes=area%7Creachfactor&format=json&interval=900&location_type=start&locations=8.212280273437502,47.41043231312493&options=%7B%7D&profile=driving-car&range=1800&range_type=time
          label: isochrones

reporting:
    - module: blazemeter
      report-name: OpenRouteService Isochrones API Concurrency Test